import React from "react";
import img from "../../assets/image/abouteMe/workspace.jpg";
function AboutUs() {
  return (
    <div className="max-w-[1440px] mx-auto px-3">
      <div className="bg-white shadow-xl my-5 lg:my-10 rounded-xl md:rounded-2xl p-3 md:p-5">
        <div className="relative flex justify-center items-center mb-5">
          <img
            className="w-full h-96 md:h-[500px] object-center object-cover rounded-xl"
            src={img}
            alt=""
          />
          <div className="absolute top-0 bg-zinc-500 bg-opacity-50 w-full h-full flex justify-center items-center text-white font-semibold rounded-xl">
            <div className="text-center space-y-5">
              <div className="text-3xl sm:text-3xl md:text-5xl ">
                ریکت فون شاپ تقدیم می کند
              </div>
              <div className="text-xl sm:text-2xl md:text-4xl">
                به شرکت مهندسی و فروشگاهی ریکت فون شاپ خوش آمدید
              </div>
            </div>
          </div>
        </div>
        <div className="space-y-7">
          <div className="leading-8 opacity-80 text-sm">
            ریکت فون شاپ مرجع تخصصی نقد و بررسی و فروش اینترنتی کالا در ایران
            است. مختلف کالا مانند کالای دیجیتال، در ریکت فون شاپ عرضه میشود.
            ریکت فون شاپ با در اختیار داشتن سهم از بازار عرضه اینترنتی کالا در
            ایران با تنوعی بسیار بالا از برندهای مختلف، در همراهی مشتریان در
            فرآیند خرید و حفظ جایگاه در میان آنها، نهایت تلاش خود را . کاربران و
            مشتریان کالا مارکت با حق انتخابی بسیار بالا و با دریافت اطلاعاتی
            کامل برای انتخاب درست کالای مورد نظر خود، وب سایت ریکت فون شاپ را
            بررسی کنند و با حداکثر اطمینان کالای خود را انتخاب و خرید کنند.
            همواره بهترین انتخاب و بهترین خدمات، شایسته مشتری ریکت فون شاپ است.
          </div>
          <div className="leading-8 opacity-80 text-sm">
            ریکت فون شاپ مرجع تخصصی نقد و بررسی و فروش اینترنتی کالا در ایران
            است. مختلف کالا مانند کالای دیجیتال، در ریکت فون شاپ عرضه میشود.
            ریکت فون شاپ با در اختیار داشتن سهم از بازار عرضه اینترنتی کالا در
            ایران با تنوعی بسیار بالا از برندهای مختلف، در همراهی مشتریان در
            فرآیند خرید و حفظ جایگاه در میان آنها، نهایت تلاش خود را . کاربران و
            مشتریان کالا مارکت با حق انتخابی بسیار بالا و با دریافت اطلاعاتی
            کامل برای انتخاب درست کالای مورد نظر خود، وب سایت ریکت فون شاپ را
            بررسی کنند و با حداکثر اطمینان کالای خود را انتخاب و خرید کنند.
            همواره بهترین انتخاب و بهترین خدمات، شایسته مشتری ریکت فون شاپ است.
          </div>
          <div className="leading-8 opacity-80 text-sm">
            ریکت فون شاپ مرجع تخصصی نقد و بررسی و فروش اینترنتی کالا در ایران
            است. مختلف کالا مانند کالای دیجیتال، در ریکت فون شاپ عرضه میشود.
            ریکت فون شاپ با در اختیار داشتن سهم از بازار عرضه اینترنتی کالا در
            ایران با تنوعی بسیار بالا از برندهای مختلف، در همراهی مشتریان در
            فرآیند خرید و حفظ جایگاه در میان آنها، نهایت تلاش خود را . کاربران و
            مشتریان کالا مارکت با حق انتخابی بسیار بالا و با دریافت اطلاعاتی
            کامل برای انتخاب درست کالای مورد نظر خود، وب سایت ریکت فون شاپ را
            بررسی کنند و با حداکثر اطمینان کالای خود را انتخاب و خرید کنند.
            همواره بهترین انتخاب و بهترین خدمات، شایسته مشتری ریکت فون شاپ است.
          </div>
          <div className="leading-8 opacity-80 text-sm">
            ریکت فون شاپ مرجع تخصصی نقد و بررسی و فروش اینترنتی کالا در ایران
            است. مختلف کالا مانند کالای دیجیتال، در ریکت فون شاپ عرضه میشود.
            ریکت فون شاپ با در اختیار داشتن سهم از بازار عرضه اینترنتی کالا در
            ایران با تنوعی بسیار بالا از برندهای مختلف، در همراهی مشتریان در
            فرآیند خرید و حفظ جایگاه در میان آنها، نهایت تلاش خود را . کاربران و
            مشتریان کالا مارکت با حق انتخابی بسیار بالا و با دریافت اطلاعاتی
            کامل برای انتخاب درست کالای مورد نظر خود، وب سایت ریکت فون شاپ را
            بررسی کنند و با حداکثر اطمینان کالای خود را انتخاب و خرید کنند.
            همواره بهترین انتخاب و بهترین خدمات، شایسته مشتری ریکت فون شاپ است.
          </div>
        </div>
      </div>
    </div>
  );
}

export default AboutUs;
