import React from "react";

function AboutUs() {
  return (
    <div className="max-w-[1440px] mx-auto px-3">
      <div className="bg-white shadow-xl my-5 lg:my-10 rounded-xl md:rounded-2xl p-3 md:p-5">
        <div className="relative flex justify-center items-center mb-5">
          <img
            className="w-full h-96 md:h-[500px] object-center object-cover rounded-xl"
            src="assets/image/abouteMe/workspace.jpg"
            alt=""
          />
          <div className="absolute top-0 bg-zinc-500 bg-opacity-50 w-full h-full flex justify-center items-center text-white font-semibold rounded-xl">
            <div className="text-center space-y-5">
              <div className="text-3xl sm:text-3xl md:text-5xl ">
                ایران مارکت تقدیم می کند
              </div>
              <div className="text-xl sm:text-2xl md:text-4xl">
                به شرکت مهندسی و فروشگاهی ایران مارکت خوش آمدید
              </div>
            </div>
          </div>
        </div>
        <div className="space-y-7">
          <div className="leading-8 opacity-80 text-sm">
            کالا مارکت مرجع تخصصی نقد و بررسی و فروش اینترنتی کالا در ایران است.
            مختلف کالا مانند کالای دیجیتال، لوازم خانگی، لوازم شخصی، فرهنگ و هنر
            و ورزش و سرگرمی با تنوعی بی‌نظیر در کالا مارکت عرضه . کالا مارکت با
            در اختیار داشتن سهم از بازار عرضه اینترنتی کالا در ایران با تنوعی
            بسیار بالا از برندهای مختلف، در همراهی مشتریان در فرآیند خرید و حفظ
            جایگاه در میان آنها، نهایت تلاش خود را . کاربران و مشتریان کالا
            مارکت با حق انتخابی بسیار بالا و با دریافت اطلاعاتی کامل برای انتخاب
            درست کالای مورد نظر خود، وب سایت ایران مارکت را بررسی کنند و با
            حداکثر اطمینان کالای خود را انتخاب و خرید کنند. همواره بهترین انتخاب
            و بهترین خدمات، شایسته مشتری ایران مارکت است.
          </div>
          <div className="leading-8 opacity-80 text-sm">
            کالا مارکت با ارائه طیف از معتبرترین برندها در مختلف و با همکاری
            نزدیک با و کنندگان اصلی این کالاها در ایران، تلاش تا نیازهای متفاوت
            مشتریان با متفاوت آنان را برآورده سازد. ارائه کاملا رقابتی و مناسب،
            همراه با کیفیت مطلوب خدمات پس از فروش از کالا مارکت محسوب می‌شود.
            کالا مارکت با درک اهمیت این موضوع برای مشتریان خود و با بکارگیری
            نهایت توان و ابزارهای در دسترس در تعاملات خود با تامین‏ کنندگان،
            می‏‏‌کوشد امکان ارائه پایین‏‏‌ترین قیمت‏‏‌ها و بهترین خدمات را فراهم
            آورد. طرح‏‏‌های مشوق خرید همواره مورد توجه مشتریان بوده و کالا مارکت
            نیز به منظور قدردانی از مشتریان وفادار خود همواره تخفیف‏‌های قابل
            توجهی را در قالب طرح‌های مختلف مشوق خرید برای آنان در نظر می‏‏‌گیرد.
            کیفیت و سهولت استفاده از وب‏ سایت کالا مارکت و خدمات ارائه شده در
            آن، همواره یکی از مهم‏‌ترین و با اولویت‌ترین موضوعات در کالا مارکت
            بوده است و همه کارکنان فنی و تخصصی آن نهایت تلاش خود را به عمل
            می‌آورند تا با ارائه با‏کیفیت‏‌ترین و به‏‌روز‏ترین مبتنی بر وب و
            تسهیل تمامی فرآیندهای بررسی، انتخاب و خرید کالا در وب سایت کالا
            مارکت، خدماتی شایسته و تجربه‌ای خوشایند را برای مخاطبان خود به
            ارمغان بیاورند.
          </div>
          <div className="leading-8 opacity-80 text-sm">
            کالا مارکت مرجع تخصصی نقد و بررسی و فروش اینترنتی کالا در ایران است.
            مختلف کالا مانند کالای دیجیتال، لوازم خانگی، لوازم شخصی، فرهنگ و هنر
            و ورزش و سرگرمی با تنوعی بی‌نظیر در کالا مارکت عرضه . کالا مارکت با
            در اختیار داشتن سهم از بازار عرضه اینترنتی کالا در ایران با تنوعی
            بسیار بالا از برندهای مختلف، در همراهی مشتریان در فرآیند خرید و حفظ
            جایگاه در میان آنها، نهایت تلاش خود را . کاربران و مشتریان کالا
            مارکت با حق انتخابی بسیار بالا و با دریافت اطلاعاتی کامل برای انتخاب
            درست کالای مورد نظر خود، وب سایت ایران مارکت را بررسی کنند و با
            حداکثر اطمینان کالای خود را انتخاب و خرید کنند. همواره بهترین انتخاب
            و بهترین خدمات، شایسته مشتری ایران مارکت است.
          </div>
          <div className="leading-8 opacity-80 text-sm">
            کالا مارکت مرجع تخصصی نقد و بررسی و فروش اینترنتی کالا در ایران است.
            مختلف کالا مانند کالای دیجیتال، لوازم خانگی، لوازم شخصی، فرهنگ و هنر
            و ورزش و سرگرمی با تنوعی بی‌نظیر در کالا مارکت عرضه . کالا مارکت با
            در اختیار داشتن سهم از بازار عرضه اینترنتی کالا در ایران با تنوعی
            بسیار بالا از برندهای مختلف، در همراهی مشتریان در فرآیند خرید و حفظ
            جایگاه در میان آنها، نهایت تلاش خود را . کاربران و مشتریان کالا
            مارکت با حق انتخابی بسیار بالا و با دریافت اطلاعاتی کامل برای انتخاب
            درست کالای مورد نظر خود، وب سایت ایران مارکت را بررسی کنند و با
            حداکثر اطمینان کالای خود را انتخاب و خرید کنند. همواره بهترین انتخاب
            و بهترین خدمات، شایسته مشتری ایران مارکت است.
          </div>
        </div>
      </div>
    </div>
  );
}

export default AboutUs;
