export default [
  {
    id: 1,
    title: "تکنولوژی های مورد استفاده شرکت های بزرگ",
    author: "علی احمدی",
    category: "تکنولوژی",
    image: "./src/assets/image/productSlider/1.jpg",
    date: new Date(2024, 11, 17),
    view: 2000,
    favorite: 455,
    content:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
  },
  {
    id: 2,
    title:
      "برای حذف میکروپلاستیک‌های موجود در آب آشامیدنی راهی بسیار ساده وجود دارد",
    author: "رضا نصیرزاده",
    category: "علمی",
    image: "./src/assets/image/productSlider/1.jpg",
    date: new Date(2024, 5, 6),
    view: 5886,
    favorite: 334,
    content:
      "تیم تحقیقاتی امیدوار است که نوشیدن آب جوشیده‌شده به عملی گسترده‌تر تبدیل شود؛ چراکه پلاستیک‌ها جهان ما را فراگرفته‌اند. هنوز دقیقاً مشخص نیست که پلاستیک موجود در آب چقدر برای بدن مضر است؛ اما واضح است که این پلاستیک میان‌وعده‌ی سالمی برای بدن ما به‌شمار نمی‌رود. پیش‌ازاین، ارتباط میان پلاستیک و تغییر در میزان میکروبیوم روده و مقاومت آنتی‌بیوتیکی بدن ثابت شده بود. تیم تحقیقاتی مطالعه‌ی اخیر اکنون قصد دارد تحقیقات بیشتری را برای یافتن پاسخ این پرسش انجام دهد که آب جوشیده چگونه می‌تواند مواد مصنوعی را از بدن ما دور نگه دارد و حتی با برخی از اثرهای هشداردهنده‌ی میکروپلاستیک‌ها که در حال ظهور هستند مقابله کند. در قسمتی از مقاله‌ی محققان آمده است: «نتایج ما ضمن تأیید استراتژی بسیار عملی برای کاهش میزان قرارگرفتن درمعرض NMPs، مسیر را برای انجام تحقیقات بیشتر با تعداد بیشتری از نمونه‌ها هموار کرده است.»",
  },
  {
    id: 3,
    title: "چطور QR را اسکن کنیم؟",
    author: "نوید عموزاده",
    category: "آموزش",
    image: "./src/assets/image/productSlider/1.jpg",
    date: new Date(2024, 4, 5),
    view: 2343,
    favorite: 233,
    content:
      "اسکن کد QR با گوشی سامسونگ در این بخش به بهترین روش‌های اسکن کد QR با گوشی سامسونگ می‌پردازیم. اسکن کد QR با استفاده از اپلیکیشن دوربین گوشی سامسونگ یکی از مزیت‌های گوشی سامسونگ این است که برای اسکن کد QR به نصب اپلیکیشن نیازی ندارید. تنها کافی است اپلیکیشن دوربین گوشی‌تان را مثل زمانی‌که عکس می‌گیرید باز کنید. سپس دوربین گوشی را بدون فشاردادن دکمه‌ی شاتر به سمت کد QR بگیرید. اگر گوشی‌تان کد را به‌درستی بخواند، اعلان کوچکی در پایین صفحه نمایان می‌شود که باید برای ادامه روی آن ضربه بزنید. مثلا اگر کد QR حاوی لینک باشد، با ضربه روی برگه مرورگرتان باز می‌شود. اسکن کد QR با گوشی سامسونگ در این بخش به بهترین روش‌های اسکن کد QR با گوشی سامسونگ می‌پردازیم. اسکن کد QR با استفاده از اپلیکیشن دوربین گوشی سامسونگ یکی از مزیت‌های گوشی سامسونگ این است که برای اسکن کد QR به نصب اپلیکیشن نیازی ندارید. تنها کافی است اپلیکیشن دوربین گوشی‌تان را مثل زمانی‌که عکس می‌گیرید باز کنید. سپس دوربین گوشی را بدون فشاردادن دکمه‌ی شاتر به سمت کد QR بگیرید. اگر گوشی‌تان کد را به‌درستی بخواند، اعلان کوچکی در پایین صفحه نمایان می‌شود که باید برای ادامه روی آن ضربه بزنید. مثلا اگر کد QR حاوی لینک باشد، با ضربه روی برگه مرورگرتان باز می‌شود. اسکن کد QR با گوشی سامسونگ در این بخش به بهترین روش‌های اسکن کد QR با گوشی سامسونگ می‌پردازیم. اسکن کد QR با استفاده از اپلیکیشن دوربین گوشی سامسونگ یکی از مزیت‌های گوشی سامسونگ این است که برای اسکن کد QR به نصب اپلیکیشن نیازی ندارید. تنها کافی است اپلیکیشن دوربین گوشی‌تان را مثل زمانی‌که عکس می‌گیرید باز کنید. سپس دوربین گوشی را بدون فشاردادن دکمه‌ی شاتر به سمت کد QR بگیرید. اگر گوشی‌تان کد را به‌درستی بخواند، اعلان کوچکی در پایین صفحه نمایان می‌شود که باید برای ادامه روی آن ضربه بزنید. مثلا اگر کد QR حاوی لینک باشد، با ضربه روی برگه مرورگرتان باز می‌شود.  ",
  },
  {
    id: 4,
    title: "چرا اروپا در حال تخریب سدهای خود است؟",
    author: "مریم صفدری",
    category: "انرژی",
    image: "./src/assets/image/productSlider/1.jpg",
    date: new Date(2024, 8, 9),
    view: 5665,
    favorite: 4355,
    content:
      "سه سال پیش، وقتی کارگران ساختمانی شروع به تخریب مجموعه‌ای از سدها روی رودخانه هیتولانیوکی در فنلاند کردند، از مشاهده دسته‌ای ماهی سالمون بسیار شگفت‌زده شدند. این ماهی‌ها که بخشی از آخرین جمعیت وحشی و محصور توسط خشکی در این کشور بودند، پس از سال‌ها غیبت درحال بازگشت به رودخانه بودند. برای پائولینا لوهی، بازگشت سالمون‌ها نشانه آغاز احیای اکوسیستم بود. لوهی، بوم‌شناس موسسه منابع طبیعی فنلاند با اشتیاق تعریف می‌کند: «فقط ماهی‌های بالغ نبودند، بلکه تعداد زیادی بچه ماهی هم وجود داشتند. آن‌ها قبلا در پایین دست رودخانه تخم‌ریزی کرده بودند. وقتی دیدم این محوطه پس از برداشتن سد چگونه است، اشک در چشمانم حلقه زد.» رودخانه هیتولانیوکی یکی از مسیرهای اصلی مهاجرت ماهی سالمون آب شیرین از دریاچه لادوگا در روسیه به فنلاند بود. اما بین سال‌های ۱۹۱۱ تا ۱۹۲۵، ساخت سه سد برای تامین انرژی برق‌آبی، موانعی را بین سالمون‌ها و مکان تخم‌ریزی آن‌ها ایجاد کرد. سالمون و ماهی‌های دیگر مانند قزل‌آلای خال‌سرخ در سمت فنلاند رودخانه گیر افتاده بودند و به مدت ۱۰۰ سال منزوی بودند. اگرچه، امروزه با تخریب سدها آب دوباره آزادانه در میان نهرهای پرشیب تازه‌ای که درختان بلند آن‌ها را احاطه کرده‌اند، جریان پیدا کرده است. هانا اولیکاینن، مدیر اجرایی سازمانی که سدها را تحویل گرفته است و مسئول توسعه محیط زیست و گردشگری است، می‌گوید: «هر بار که سدی برچیده می‌شود، سالمون‌ها بخش جدیدی از رودخانه را در آغوش می‌گیرند.» یک سوم از رودخانه‌های جهان با طول بیش از هزار کیلومتر در کل مسیر خود جریان آزاد دارند در سال ۲۰۲۱ پس از مرحله‌ی اول تخریب سد، پنج لانه تخم‌ریزی مشاهده شد. در پاییز سال ۲۰۲۲، یعنی یک سال بعد، تعداد بچه ماهی‌ها به رکورد ۲۰۰ ماهی در ۰٫۴ هکتار رسید. وقتی در دسامبر ۲۰۲۳ تخریب سد ریتاکوسکی به پایان رسید، آن‌ها به سمت قسمت‌های بالای رودخانه و شاخه‌های آن راه پیدا کردند. برچیدن سد نتیجه ده‌ها سال تلاشی بود که نه تنها سلامت رودخانه، بلکه شرایط اقتصادی را نیز درنظر می‌گرفت. نتیجه‌ی ارزیابی‌ها این بود که تولید برق آن‌ها دیگر برای صاحبان نیروگاه سودی ندارد؛ خصوصا وقتی هزینه‌های نگهداری و حفاظت‌های زیست‌محیطی اجباری مانند ساخت گذرگاه‌های ماهی درنظر گرفته می‌شد. بنابراین، سدها فروخته و تخریب شدند. سه سال پیش، وقتی کارگران ساختمانی شروع به تخریب مجموعه‌ای از سدها روی رودخانه هیتولانیوکی در فنلاند کردند، از مشاهده دسته‌ای ماهی سالمون بسیار شگفت‌زده شدند. این ماهی‌ها که بخشی از آخرین جمعیت وحشی و محصور توسط خشکی در این کشور بودند، پس از سال‌ها غیبت درحال بازگشت به رودخانه بودند. برای پائولینا لوهی، بازگشت سالمون‌ها نشانه آغاز احیای اکوسیستم بود. لوهی، بوم‌شناس موسسه منابع طبیعی فنلاند با اشتیاق تعریف می‌کند: «فقط ماهی‌های بالغ نبودند، بلکه تعداد زیادی بچه ماهی هم وجود داشتند. آن‌ها قبلا در پایین دست رودخانه تخم‌ریزی کرده بودند. وقتی دیدم این محوطه پس از برداشتن سد چگونه است، اشک در چشمانم حلقه زد.» رودخانه هیتولانیوکی یکی از مسیرهای اصلی مهاجرت ماهی سالمون آب شیرین از دریاچه لادوگا در روسیه به فنلاند بود. اما بین سال‌های ۱۹۱۱ تا ۱۹۲۵، ساخت سه سد برای تامین انرژی برق‌آبی، موانعی را بین سالمون‌ها و مکان تخم‌ریزی آن‌ها ایجاد کرد. سالمون و ماهی‌های دیگر مانند قزل‌آلای خال‌سرخ در سمت فنلاند رودخانه گیر افتاده بودند و به مدت ۱۰۰ سال منزوی بودند. اگرچه، امروزه با تخریب سدها آب دوباره آزادانه در میان نهرهای پرشیب تازه‌ای که درختان بلند آن‌ها را احاطه کرده‌اند، جریان پیدا کرده است. هانا اولیکاینن، مدیر اجرایی سازمانی که سدها را تحویل گرفته است و مسئول توسعه محیط زیست و گردشگری است، می‌گوید: «هر بار که سدی برچیده می‌شود، سالمون‌ها بخش جدیدی از رودخانه را در آغوش می‌گیرند.» یک سوم از رودخانه‌های جهان با طول بیش از هزار کیلومتر در کل مسیر خود جریان آزاد دارند در سال ۲۰۲۱ پس از مرحله‌ی اول تخریب سد، پنج لانه تخم‌ریزی مشاهده شد. در پاییز سال ۲۰۲۲، یعنی یک سال بعد، تعداد بچه ماهی‌ها به رکورد ۲۰۰ ماهی در ۰٫۴ هکتار رسید. وقتی در دسامبر ۲۰۲۳ تخریب سد ریتاکوسکی به پایان رسید، آن‌ها به سمت قسمت‌های بالای رودخانه و شاخه‌های آن راه پیدا کردند. برچیدن سد نتیجه ده‌ها سال تلاشی بود که نه تنها سلامت رودخانه، بلکه شرایط اقتصادی را نیز درنظر می‌گرفت. نتیجه‌ی ارزیابی‌ها این بود که تولید برق آن‌ها دیگر برای صاحبان نیروگاه سودی ندارد؛ خصوصا وقتی هزینه‌های نگهداری و حفاظت‌های زیست‌محیطی اجباری مانند ساخت گذرگاه‌های ماهی درنظر گرفته می‌شد. بنابراین، سدها فروخته و تخریب شدند. سه سال پیش، وقتی کارگران ساختمانی شروع به تخریب مجموعه‌ای از سدها روی رودخانه هیتولانیوکی در فنلاند کردند، از مشاهده دسته‌ای ماهی سالمون بسیار شگفت‌زده شدند. این ماهی‌ها که بخشی از آخرین جمعیت وحشی و محصور توسط خشکی در این کشور بودند، پس از سال‌ها غیبت درحال بازگشت به رودخانه بودند. برای پائولینا لوهی، بازگشت سالمون‌ها نشانه آغاز احیای اکوسیستم بود. لوهی، بوم‌شناس موسسه منابع طبیعی فنلاند با اشتیاق تعریف می‌کند: «فقط ماهی‌های بالغ نبودند، بلکه تعداد زیادی بچه ماهی هم وجود داشتند. آن‌ها قبلا در پایین دست رودخانه تخم‌ریزی کرده بودند. وقتی دیدم این محوطه پس از برداشتن سد چگونه است، اشک در چشمانم حلقه زد.» رودخانه هیتولانیوکی یکی از مسیرهای اصلی مهاجرت ماهی سالمون آب شیرین از دریاچه لادوگا در روسیه به فنلاند بود. اما بین سال‌های ۱۹۱۱ تا ۱۹۲۵، ساخت سه سد برای تامین انرژی برق‌آبی، موانعی را بین سالمون‌ها و مکان تخم‌ریزی آن‌ها ایجاد کرد. سالمون و ماهی‌های دیگر مانند قزل‌آلای خال‌سرخ در سمت فنلاند رودخانه گیر افتاده بودند و به مدت ۱۰۰ سال منزوی بودند. اگرچه، امروزه با تخریب سدها آب دوباره آزادانه در میان نهرهای پرشیب تازه‌ای که درختان بلند آن‌ها را احاطه کرده‌اند، جریان پیدا کرده است. هانا اولیکاینن، مدیر اجرایی سازمانی که سدها را تحویل گرفته است و مسئول توسعه محیط زیست و گردشگری است، می‌گوید: «هر بار که سدی برچیده می‌شود، سالمون‌ها بخش جدیدی از رودخانه را در آغوش می‌گیرند.» یک سوم از رودخانه‌های جهان با طول بیش از هزار کیلومتر در کل مسیر خود جریان آزاد دارند در سال ۲۰۲۱ پس از مرحله‌ی اول تخریب سد، پنج لانه تخم‌ریزی مشاهده شد. در پاییز سال ۲۰۲۲، یعنی یک سال بعد، تعداد بچه ماهی‌ها به رکورد ۲۰۰ ماهی در ۰٫۴ هکتار رسید. وقتی در دسامبر ۲۰۲۳ تخریب سد ریتاکوسکی به پایان رسید، آن‌ها به سمت قسمت‌های بالای رودخانه و شاخه‌های آن راه پیدا کردند. برچیدن سد نتیجه ده‌ها سال تلاشی بود که نه تنها سلامت رودخانه، بلکه شرایط اقتصادی را نیز درنظر می‌گرفت. نتیجه‌ی ارزیابی‌ها این بود که تولید برق آن‌ها دیگر برای صاحبان نیروگاه سودی ندارد؛ خصوصا وقتی هزینه‌های نگهداری و حفاظت‌های زیست‌محیطی اجباری مانند ساخت گذرگاه‌های ماهی درنظر گرفته می‌شد. بنابراین، سدها فروخته و تخریب شدند.",
  },
  {
    id: 5,
    title: "این ۴ گوشی سامسونگ از امروز منسوخ هستند و دیگر آپدیت نمی‌شوند",
    author: "رضا رضائی",
    category: "تکنولوژی",
    image: "./src/assets/image/productSlider/1.jpg",
    date: new Date(2024, 4, 12),
    view: 456,
    favorite: 23,
    content:
      "سامسونگ مدتی قبل به انتشار به‌روزرسانی‌های بزرگ برای گوشی‌های نام‌برده پایان داده بود و فقط برای آن‌ها به‌روزرسانی‌های امنیتی منتشر می‌کرد، اما کره‌‌ای‌ها اکنون تصمیم گرفته‌اند دیگر هیچ به‌روزرسانی جدیدی برای دستگاه‌های یادشده منتشر نکنند. سامسونگ مدتی قبل به انتشار به‌روزرسانی‌های بزرگ برای گوشی‌های نام‌برده پایان داده بود و فقط برای آن‌ها به‌روزرسانی‌های امنیتی منتشر می‌کرد، اما کره‌‌ای‌ها اکنون تصمیم گرفته‌اند دیگر هیچ به‌روزرسانی جدیدی برای دستگاه‌های یادشده منتشر نکنند. سامسونگ مدتی قبل به انتشار به‌روزرسانی‌های بزرگ برای گوشی‌های نام‌برده پایان داده بود و فقط برای آن‌ها به‌روزرسانی‌های امنیتی منتشر می‌کرد، اما کره‌‌ای‌ها اکنون تصمیم گرفته‌اند دیگر هیچ به‌روزرسانی جدیدی برای دستگاه‌های یادشده منتشر نکنند. سامسونگ مدتی قبل به انتشار به‌روزرسانی‌های بزرگ برای گوشی‌های نام‌برده پایان داده بود و فقط برای آن‌ها به‌روزرسانی‌های امنیتی منتشر می‌کرد، اما کره‌‌ای‌ها اکنون تصمیم گرفته‌اند دیگر هیچ به‌روزرسانی جدیدی برای دستگاه‌های یادشده منتشر نکنند. سامسونگ مدتی قبل به انتشار به‌روزرسانی‌های بزرگ برای گوشی‌های نام‌برده پایان داده بود و فقط برای آن‌ها به‌روزرسانی‌های امنیتی منتشر می‌کرد، اما کره‌‌ای‌ها اکنون تصمیم گرفته‌اند دیگر هیچ به‌روزرسانی جدیدی برای دستگاه‌های یادشده منتشر نکنند. ",
  },
  {
    id: 6,
    title: "یکی از مشکلات آزاردهنده گوگل کروم در ویندوز برطرف می‌شود",
    author: "امیر عبدالملکی",
    category: "تکنولوژی",
    image: "./src/assets/image/productSlider/1.jpg",
    date: new Date(2024, 6, 17),
    view: 877,
    favorite: 554,
    content:
      "مایکروسافت قرار است کد Chromium را با در نظر گرفتن ویژگی‌های ویندوز اصلاح کند تا مقادیر کنتراست و گامای تنظیم‌شده با Windows ClearType Text Tuner را بگیرد و آن‌ها را به موتور رندرینگ Skia تحویل دهد. به این ترتیب Skia می‌تواند متن را به روشی که کاربر می‌خواهد رندر و از بروز هرگونه مشکل مشابه در آینده جلوگیری کند. مایکروسافت قرار است کد Chromium را با در نظر گرفتن ویژگی‌های ویندوز اصلاح کند تا مقادیر کنتراست و گامای تنظیم‌شده با Windows ClearType Text Tuner را بگیرد و آن‌ها را به موتور رندرینگ Skia تحویل دهد. به این ترتیب Skia می‌تواند متن را به روشی که کاربر می‌خواهد رندر و از بروز هرگونه مشکل مشابه در آینده جلوگیری کند. مایکروسافت قرار است کد Chromium را با در نظر گرفتن ویژگی‌های ویندوز اصلاح کند تا مقادیر کنتراست و گامای تنظیم‌شده با Windows ClearType Text Tuner را بگیرد و آن‌ها را به موتور رندرینگ Skia تحویل دهد. به این ترتیب Skia می‌تواند متن را به روشی که کاربر می‌خواهد رندر و از بروز هرگونه مشکل مشابه در آینده جلوگیری کند. مایکروسافت قرار است کد Chromium را با در نظر گرفتن ویژگی‌های ویندوز اصلاح کند تا مقادیر کنتراست و گامای تنظیم‌شده با Windows ClearType Text Tuner را بگیرد و آن‌ها را به موتور رندرینگ Skia تحویل دهد. به این ترتیب Skia می‌تواند متن را به روشی که کاربر می‌خواهد رندر و از بروز هرگونه مشکل مشابه در آینده جلوگیری کند. مایکروسافت قرار است کد Chromium را با در نظر گرفتن ویژگی‌های ویندوز اصلاح کند تا مقادیر کنتراست و گامای تنظیم‌شده با Windows ClearType Text Tuner را بگیرد و آن‌ها را به موتور رندرینگ Skia تحویل دهد. به این ترتیب Skia می‌تواند متن را به روشی که کاربر می‌خواهد رندر و از بروز هرگونه مشکل مشابه در آینده جلوگیری کند.",
  },
];
