import img1 from "./assets/image/blog/1.webp";
import img2 from "./assets/image/blog/2.webp";
import img3 from "./assets/image/blog/3.webp";
import img4 from "./assets/image/blog/4.webp";
import img5 from "./assets/image/blog/5.webp";
import img6 from "./assets/image/blog/6.webp";
import img7 from "./assets/image/blog/7.webp";

import img9 from "./assets/image/blog/9.webp";
import img10 from "./assets/image/blog/10.webp";

export default [
  {
    id: 1,
    title:
      "گلکسی A35 در برابر گلکسی A55؛ بهترین میان‌رده ۲۰۲۴ سامسونگ کدام است؟",
    author: "علی احمدی",
    category: "تکنولوژی",
    image: img1,
    date: new Date(2024, 11, 17),
    view: 2000,
    favorite: 455,
    content:
      "مهم‌ترین تفاوت کلیدی دو میان‌رده‌ی جدید سامسونگ به فریم گوشی‌ها مربوط می‌شود. در گلکسی A55، سامسونگ به‌سراغ فریم فلزی رفته، ولی درمورد گلکسی A35 به همان فریم پلاستیکی موجود در بسیاری از گوشی‌های میان‌رده روی آورده است. البته این موضوع شاید بیش از A55 به نفع A35 باشد؛ چون با وزن ۲۰۹ گرمی، حدوداً ۴ گرم از گلکسی A55 سبک‌تر است. جدای از بحث فریم، تفاوت عمده‌ای در بخش طراحی گوشی‌ها به‌چشم نمی‌آید. هر دو گوشی از بدنه‌ای شیشه‌ای و گواهی IP67 برای مقاومت دربرابر آب و گردوغبار بهره می‌برند، جای‌گیری ماژول‌های دوربین‌شان کاملا شبیه به هم است و حتی در زمینه‌ی رنگ‌بندی نیز تفاوتی ندارند؛ هردو مدل، در رنگ‌های مشکی، آبی یخی، بنفش یاسی و زرد لیمویی روانه‌ی بازار شده‌اند. نمایشگر گلکسی A55 و گلکسی A35 هردو از نمایشگر ۶٫۶ اینچی OLED با وضوح ۱۰۸۰ در ۲۳۴۰ پیکسل و نرخ نوسازی ۱۲۰ هرتز استفاده می‌کنند. براساس ادعای سامسونگ میزان روشنایی آن‌ها در بهترین حالت به ۱۰۰۰ نیت می‌رسد؛ ولی بررسی‌های زومیت نشان می‌دهد که روشنایی A55 در حالت خودکار به ۱۵۰۰ نیت و روشنایی A35 در حالت خودکار به ۱۴۷۰ نیت خواهد رسید. از طرفی، هردو گوشی از +HDR10 نیز پشتیبانی می‌کنند و هنگام پخش محتوای HDR روشنایی آن‌ها از این میزان هم بالاتر رفته و به محدوده‌ی ۱۹۰۰ نیت نزدیک می‌شود. سامسونگ برای محافظت از صفحه‌نمایش هردو گوشی میان‌رده‌اش سنگ‌تمام گذاشته و به سراغ +Gorilla Glass Victus رفته است که حداقل روی کاغذ، بسیار مقاوم‌تر از دیگر محافظ‌ها ظاهر می‌شود. به‌طورکلی در بخش نمایشگر و حداقل در زمینه‌ی روشنایی، کفه‌ی ترازو اندکی به سمت گلکسی A55 سنگینی می‌کند، اما در مجموع، اختلاف معناداری بین دو مدل دیده نمی‌شود. سخت‌افزار و عملکرد هردو گوشی جدید سامسونگ به تراشه‌های Exynos همین شرکت مجهز شده‌اند. گلکسی A35 با تراشه‌‌ی Exynos 1380 متشکل از ۴ هسته‌ی Cortex-A78 و ۴ هسته‌ی Cortex-A55 در بخش CPU، همراه شده است و پردازنده‌ی گرافیکی Xclipse 530 آن را همراهی می‌کند. نکته‌ی جالب اینکه همین تراشه را سال گذشته، در A54 هم دیده بودیم و خبری از تراشه‌ی جدید در دل A35 نیست. در مقابل، گلکسی A55 از نسل جدید تراشه‌ی A35 یعنی Exynos 1380 استفاده می‌کند که در بخش گرافیک، از ماژول Mali-G68 MP5 بهره می‌گیرد. با تمام تفاسیر، مقایسه‌ی تراشه‌های دو نسل پی‌درپی، خالی از لطف نخواهد بود.",
  },
  {
    id: 2,
    title: "اچ‌تی‌سی با موبایلی میان‌رده برمی‌گردد",
    author: "رضا نصیرزاده",
    category: "علمی",
    image: img2,
    date: new Date(2024, 5, 6),
    view: 5886,
    favorite: 334,
    content:
      "ظاهراً HTC قصد دارد پس از مدت‌ها، با رونمایی موبایلی میان‌رده به بازار برگردد. به‌نظر می‌رسد HTC روی گوشی جدیدی کار می‌کند که احتمالاً به‌زودی عرضه خواهد شد. این گوشی در گیک‌بنچ رؤیت شده و گواهی بلوتوث SIG را دریافت کرده است. گوشی جدید اچ‌تی‌سی شناسه‌ی 2QDA100 را دارد و احتمالاً جانشین U23 خواهد بود؛ بنابراین، می‌توان حدس زد که با نام U24 یا U24 Pro معرفی شود. گوشی جدید HTC در بخش تک‌هسته‌ای و چندهسته‌ای گیک‌بنچ به‌ترتیب امتیاز ۱٬۰۹۵ و ۳٬۰۰۶ را کسب کرده است. انتظار می‌رود که گوشی ۲۰۲۴ اچ‌تی‌سی به تراشه‌ی اسنپدراگون ۷ نسل ۳ مجهز باشد که پردازنده‌ی مرکزی ۸ هسته‌ای و گرافیک Adreno 720 در آن قرار دارد. این گوشی احتمالاً ۱۲ گیگابایت رم خواهد داشت و سیستم‌عامل اندروید ۱۴ را اجرا خواهد کرد. گوشی HTC مدل U23 از تراشه‌ی اسنپدراگون ۷ نسل ۱ استفاده می‌کرد؛ بنابراین، انتظار داریم که سری U24 عملکرد بهتری داشته باشد. گواهی Bluetooth SIG تأیید می‌کند که این دستگاه از بلوتوث ۵٫۳ پشتیبانی می‌کند.",
  },
  {
    id: 3,
    title:
      "مشخصات سرفیس لپ تاپ ۶ در آستانه رونمایی لو رفت؛ لپ تاپ پرقدرت مایکروسافت",
    author: "نوید عموزاده",
    category: "آموزش",
    image: img3,
    date: new Date(2024, 4, 5),
    view: 2343,
    favorite: 233,
    content:
      "مشخصات سرفیس لپ تاپ ۶ در آستانه رونمایی لو رفت؛ لپ تاپ پرقدرت مایکروسافت احتمال دارد که سرفیس لپ‌تاپ ۶ نسخه‌ای مجهز به پردازنده اینتل داشته باشد و از مدل‌های Core Ultra 5 135H و Core Ultra 7 165H قدرت بگیرد. گفته می‌شود مدل اسنپدراگون سرفیس لپ‌تاپ ۶ با ۸ و ۱۶ یا ۳۲ گیگابایت رم LPDDR5X و ۲۵۶ و ۵۱۲ یا یک ترابایت SSD در دسترس خریداران قرار خواهد گرفت. ظرفیت باتری سرفیس لپ‌تاپ ۶ فاش‌نشده است؛ اما ظاهراً مدل ۱۳٫۵ اینچی تا ۲۲ ساعت و مدل ۱۵ اینچی تا ۲۱ ساعت در استفاده‌های معمولی شارژدهی خواهند داشت. مایکروسافت ۳۱ اردیبهشت سرفیس‌های جدید مجهز به اسنپدراگون ایکس الیت را معرفی خواهد کرد. باید دید قیمت لپ تاپ های مجهز به تراشه‌ی جدید کوالکام چقدر با سایر لپ‌تاپ‌ها تفاوت دارد.",
  },
  {
    id: 4,
    title: "چرا اروپا در حال تخریب سدهای خود است؟",
    author: "مریم صفدری",
    category: "انرژی",
    image: img4,
    date: new Date(2024, 8, 9),
    view: 5665,
    favorite: 4355,
    content:
      "سه سال پیش، وقتی کارگران ساختمانی شروع به تخریب مجموعه‌ای از سدها روی رودخانه هیتولانیوکی در فنلاند کردند، از مشاهده دسته‌ای ماهی سالمون بسیار شگفت‌زده شدند. این ماهی‌ها که بخشی از آخرین جمعیت وحشی و محصور توسط خشکی در این کشور بودند، پس از سال‌ها غیبت درحال بازگشت به رودخانه بودند. برای پائولینا لوهی، بازگشت سالمون‌ها نشانه آغاز احیای اکوسیستم بود. لوهی، بوم‌شناس موسسه منابع طبیعی فنلاند با اشتیاق تعریف می‌کند: «فقط ماهی‌های بالغ نبودند، بلکه تعداد زیادی بچه ماهی هم وجود داشتند. آن‌ها قبلا در پایین دست رودخانه تخم‌ریزی کرده بودند. وقتی دیدم این محوطه پس از برداشتن سد چگونه است، اشک در چشمانم حلقه زد.» رودخانه هیتولانیوکی یکی از مسیرهای اصلی مهاجرت ماهی سالمون آب شیرین از دریاچه لادوگا در روسیه به فنلاند بود. اما بین سال‌های ۱۹۱۱ تا ۱۹۲۵، ساخت سه سد برای تامین انرژی برق‌آبی، موانعی را بین سالمون‌ها و مکان تخم‌ریزی آن‌ها ایجاد کرد. سالمون و ماهی‌های دیگر مانند قزل‌آلای خال‌سرخ در سمت فنلاند رودخانه گیر افتاده بودند و به مدت ۱۰۰ سال منزوی بودند. اگرچه، امروزه با تخریب سدها آب دوباره آزادانه در میان نهرهای پرشیب تازه‌ای که درختان بلند آن‌ها را احاطه کرده‌اند، جریان پیدا کرده است. هانا اولیکاینن، مدیر اجرایی سازمانی که سدها را تحویل گرفته است و مسئول توسعه محیط زیست و گردشگری است، می‌گوید: «هر بار که سدی برچیده می‌شود، سالمون‌ها بخش جدیدی از رودخانه را در آغوش می‌گیرند.» یک سوم از رودخانه‌های جهان با طول بیش از هزار کیلومتر در کل مسیر خود جریان آزاد دارند در سال ۲۰۲۱ پس از مرحله‌ی اول تخریب سد، پنج لانه تخم‌ریزی مشاهده شد. در پاییز سال ۲۰۲۲، یعنی یک سال بعد، تعداد بچه ماهی‌ها به رکورد ۲۰۰ ماهی در ۰٫۴ هکتار رسید. وقتی در دسامبر ۲۰۲۳ تخریب سد ریتاکوسکی به پایان رسید، آن‌ها به سمت قسمت‌های بالای رودخانه و شاخه‌های آن راه پیدا کردند. برچیدن سد نتیجه ده‌ها سال تلاشی بود که نه تنها سلامت رودخانه، بلکه شرایط اقتصادی را نیز درنظر می‌گرفت. نتیجه‌ی ارزیابی‌ها این بود که تولید برق آن‌ها دیگر برای صاحبان نیروگاه سودی ندارد؛ خصوصا وقتی هزینه‌های نگهداری و حفاظت‌های زیست‌محیطی اجباری مانند ساخت گذرگاه‌های ماهی درنظر گرفته می‌شد. بنابراین، سدها فروخته و تخریب شدند. سه سال پیش، وقتی کارگران ساختمانی شروع به تخریب مجموعه‌ای از سدها روی رودخانه هیتولانیوکی در فنلاند کردند، از مشاهده دسته‌ای ماهی سالمون بسیار شگفت‌زده شدند. این ماهی‌ها که بخشی از آخرین جمعیت وحشی و محصور توسط خشکی در این کشور بودند، پس از سال‌ها غیبت درحال بازگشت به رودخانه بودند. برای پائولینا لوهی، بازگشت سالمون‌ها نشانه آغاز احیای اکوسیستم بود. لوهی، بوم‌شناس موسسه منابع طبیعی فنلاند با اشتیاق تعریف می‌کند: «فقط ماهی‌های بالغ نبودند، بلکه تعداد زیادی بچه ماهی هم وجود داشتند. آن‌ها قبلا در پایین دست رودخانه تخم‌ریزی کرده بودند. وقتی دیدم این محوطه پس از برداشتن سد چگونه است، اشک در چشمانم حلقه زد.» رودخانه هیتولانیوکی یکی از مسیرهای اصلی مهاجرت ماهی سالمون آب شیرین از دریاچه لادوگا در روسیه به فنلاند بود. اما بین سال‌های ۱۹۱۱ تا ۱۹۲۵، ساخت سه سد برای تامین انرژی برق‌آبی، موانعی را بین سالمون‌ها و مکان تخم‌ریزی آن‌ها ایجاد کرد. سالمون و ماهی‌های دیگر مانند قزل‌آلای خال‌سرخ در سمت فنلاند رودخانه گیر افتاده بودند و به مدت ۱۰۰ سال منزوی بودند. اگرچه، امروزه با تخریب سدها آب دوباره آزادانه در میان نهرهای پرشیب تازه‌ای که درختان بلند آن‌ها را احاطه کرده‌اند، جریان پیدا کرده است. هانا اولیکاینن، مدیر اجرایی سازمانی که سدها را تحویل گرفته است و مسئول توسعه محیط زیست و گردشگری است، می‌گوید: «هر بار که سدی برچیده می‌شود، سالمون‌ها بخش جدیدی از رودخانه را در آغوش می‌گیرند.» یک سوم از رودخانه‌های جهان با طول بیش از هزار کیلومتر در کل مسیر خود جریان آزاد دارند در سال ۲۰۲۱ پس از مرحله‌ی اول تخریب سد، پنج لانه تخم‌ریزی مشاهده شد. در پاییز سال ۲۰۲۲، یعنی یک سال بعد، تعداد بچه ماهی‌ها به رکورد ۲۰۰ ماهی در ۰٫۴ هکتار رسید. وقتی در دسامبر ۲۰۲۳ تخریب سد ریتاکوسکی به پایان رسید، آن‌ها به سمت قسمت‌های بالای رودخانه و شاخه‌های آن راه پیدا کردند. برچیدن سد نتیجه ده‌ها سال تلاشی بود که نه تنها سلامت رودخانه، بلکه شرایط اقتصادی را نیز درنظر می‌گرفت. نتیجه‌ی ارزیابی‌ها این بود که تولید برق آن‌ها دیگر برای صاحبان نیروگاه سودی ندارد؛ خصوصا وقتی هزینه‌های نگهداری و حفاظت‌های زیست‌محیطی اجباری مانند ساخت گذرگاه‌های ماهی درنظر گرفته می‌شد. بنابراین، سدها فروخته و تخریب شدند. سه سال پیش، وقتی کارگران ساختمانی شروع به تخریب مجموعه‌ای از سدها روی رودخانه هیتولانیوکی در فنلاند کردند، از مشاهده دسته‌ای ماهی سالمون بسیار شگفت‌زده شدند. این ماهی‌ها که بخشی از آخرین جمعیت وحشی و محصور توسط خشکی در این کشور بودند، پس از سال‌ها غیبت درحال بازگشت به رودخانه بودند. برای پائولینا لوهی، بازگشت سالمون‌ها نشانه آغاز احیای اکوسیستم بود. لوهی، بوم‌شناس موسسه منابع طبیعی فنلاند با اشتیاق تعریف می‌کند: «فقط ماهی‌های بالغ نبودند، بلکه تعداد زیادی بچه ماهی هم وجود داشتند. آن‌ها قبلا در پایین دست رودخانه تخم‌ریزی کرده بودند. وقتی دیدم این محوطه پس از برداشتن سد چگونه است، اشک در چشمانم حلقه زد.» رودخانه هیتولانیوکی یکی از مسیرهای اصلی مهاجرت ماهی سالمون آب شیرین از دریاچه لادوگا در روسیه به فنلاند بود. اما بین سال‌های ۱۹۱۱ تا ۱۹۲۵، ساخت سه سد برای تامین انرژی برق‌آبی، موانعی را بین سالمون‌ها و مکان تخم‌ریزی آن‌ها ایجاد کرد. سالمون و ماهی‌های دیگر مانند قزل‌آلای خال‌سرخ در سمت فنلاند رودخانه گیر افتاده بودند و به مدت ۱۰۰ سال منزوی بودند. اگرچه، امروزه با تخریب سدها آب دوباره آزادانه در میان نهرهای پرشیب تازه‌ای که درختان بلند آن‌ها را احاطه کرده‌اند، جریان پیدا کرده است. هانا اولیکاینن، مدیر اجرایی سازمانی که سدها را تحویل گرفته است و مسئول توسعه محیط زیست و گردشگری است، می‌گوید: «هر بار که سدی برچیده می‌شود، سالمون‌ها بخش جدیدی از رودخانه را در آغوش می‌گیرند.» یک سوم از رودخانه‌های جهان با طول بیش از هزار کیلومتر در کل مسیر خود جریان آزاد دارند در سال ۲۰۲۱ پس از مرحله‌ی اول تخریب سد، پنج لانه تخم‌ریزی مشاهده شد. در پاییز سال ۲۰۲۲، یعنی یک سال بعد، تعداد بچه ماهی‌ها به رکورد ۲۰۰ ماهی در ۰٫۴ هکتار رسید. وقتی در دسامبر ۲۰۲۳ تخریب سد ریتاکوسکی به پایان رسید، آن‌ها به سمت قسمت‌های بالای رودخانه و شاخه‌های آن راه پیدا کردند. برچیدن سد نتیجه ده‌ها سال تلاشی بود که نه تنها سلامت رودخانه، بلکه شرایط اقتصادی را نیز درنظر می‌گرفت. نتیجه‌ی ارزیابی‌ها این بود که تولید برق آن‌ها دیگر برای صاحبان نیروگاه سودی ندارد؛ خصوصا وقتی هزینه‌های نگهداری و حفاظت‌های زیست‌محیطی اجباری مانند ساخت گذرگاه‌های ماهی درنظر گرفته می‌شد. بنابراین، سدها فروخته و تخریب شدند.",
  },
  {
    id: 5,
    title: "این ۴ گوشی سامسونگ از امروز منسوخ هستند و دیگر آپدیت نمی‌شوند",
    author: "رضا رضائی",
    category: "تکنولوژی",
    image: img5,
    date: new Date(2024, 4, 12),
    view: 456,
    favorite: 23,
    content:
      "سامسونگ مدتی قبل به انتشار به‌روزرسانی‌های بزرگ برای گوشی‌های نام‌برده پایان داده بود و فقط برای آن‌ها به‌روزرسانی‌های امنیتی منتشر می‌کرد، اما کره‌‌ای‌ها اکنون تصمیم گرفته‌اند دیگر هیچ به‌روزرسانی جدیدی برای دستگاه‌های یادشده منتشر نکنند. سامسونگ مدتی قبل به انتشار به‌روزرسانی‌های بزرگ برای گوشی‌های نام‌برده پایان داده بود و فقط برای آن‌ها به‌روزرسانی‌های امنیتی منتشر می‌کرد، اما کره‌‌ای‌ها اکنون تصمیم گرفته‌اند دیگر هیچ به‌روزرسانی جدیدی برای دستگاه‌های یادشده منتشر نکنند. سامسونگ مدتی قبل به انتشار به‌روزرسانی‌های بزرگ برای گوشی‌های نام‌برده پایان داده بود و فقط برای آن‌ها به‌روزرسانی‌های امنیتی منتشر می‌کرد، اما کره‌‌ای‌ها اکنون تصمیم گرفته‌اند دیگر هیچ به‌روزرسانی جدیدی برای دستگاه‌های یادشده منتشر نکنند. سامسونگ مدتی قبل به انتشار به‌روزرسانی‌های بزرگ برای گوشی‌های نام‌برده پایان داده بود و فقط برای آن‌ها به‌روزرسانی‌های امنیتی منتشر می‌کرد، اما کره‌‌ای‌ها اکنون تصمیم گرفته‌اند دیگر هیچ به‌روزرسانی جدیدی برای دستگاه‌های یادشده منتشر نکنند. سامسونگ مدتی قبل به انتشار به‌روزرسانی‌های بزرگ برای گوشی‌های نام‌برده پایان داده بود و فقط برای آن‌ها به‌روزرسانی‌های امنیتی منتشر می‌کرد، اما کره‌‌ای‌ها اکنون تصمیم گرفته‌اند دیگر هیچ به‌روزرسانی جدیدی برای دستگاه‌های یادشده منتشر نکنند. ",
  },
  {
    id: 6,
    title: "یکی از مشکلات آزاردهنده گوگل کروم در ویندوز برطرف می‌شود",
    author: "امیر عبدالملکی",
    category: "تکنولوژی",
    image: img6,
    date: new Date(2024, 6, 17),
    view: 877,
    favorite: 554,
    content:
      "مایکروسافت قرار است کد Chromium را با در نظر گرفتن ویژگی‌های ویندوز اصلاح کند تا مقادیر کنتراست و گامای تنظیم‌شده با Windows ClearType Text Tuner را بگیرد و آن‌ها را به موتور رندرینگ Skia تحویل دهد. به این ترتیب Skia می‌تواند متن را به روشی که کاربر می‌خواهد رندر و از بروز هرگونه مشکل مشابه در آینده جلوگیری کند. مایکروسافت قرار است کد Chromium را با در نظر گرفتن ویژگی‌های ویندوز اصلاح کند تا مقادیر کنتراست و گامای تنظیم‌شده با Windows ClearType Text Tuner را بگیرد و آن‌ها را به موتور رندرینگ Skia تحویل دهد. به این ترتیب Skia می‌تواند متن را به روشی که کاربر می‌خواهد رندر و از بروز هرگونه مشکل مشابه در آینده جلوگیری کند. مایکروسافت قرار است کد Chromium را با در نظر گرفتن ویژگی‌های ویندوز اصلاح کند تا مقادیر کنتراست و گامای تنظیم‌شده با Windows ClearType Text Tuner را بگیرد و آن‌ها را به موتور رندرینگ Skia تحویل دهد. به این ترتیب Skia می‌تواند متن را به روشی که کاربر می‌خواهد رندر و از بروز هرگونه مشکل مشابه در آینده جلوگیری کند. مایکروسافت قرار است کد Chromium را با در نظر گرفتن ویژگی‌های ویندوز اصلاح کند تا مقادیر کنتراست و گامای تنظیم‌شده با Windows ClearType Text Tuner را بگیرد و آن‌ها را به موتور رندرینگ Skia تحویل دهد. به این ترتیب Skia می‌تواند متن را به روشی که کاربر می‌خواهد رندر و از بروز هرگونه مشکل مشابه در آینده جلوگیری کند. مایکروسافت قرار است کد Chromium را با در نظر گرفتن ویژگی‌های ویندوز اصلاح کند تا مقادیر کنتراست و گامای تنظیم‌شده با Windows ClearType Text Tuner را بگیرد و آن‌ها را به موتور رندرینگ Skia تحویل دهد. به این ترتیب Skia می‌تواند متن را به روشی که کاربر می‌خواهد رندر و از بروز هرگونه مشکل مشابه در آینده جلوگیری کند.",
  },

  {
    id: 7,
    title: "گوگل پلی با تغییری کاربردی آپدیت ",

    author: "امیر عبدالملکی",
    category: "تکنولوژی",
    image: img7,
    date: new Date(2024, 7, 27),
    view: 877,
    favorite: 554,
    content:
      "تغییر موردانتظار و کاربردی فروشگاه آنلاین گوگل پلی پس از مدت‌ها سرانجام به‌صورت رسمی اعمال شد. گوگل پس از مدت‌ها بررسی، سرانجام دانلود و نصب هم‌زمان دو اپلیکیشن را در فروشگاه پلی استور فعال کرد. بنابر گزارش to5Google، این ویژگی فقط برای نصب دو اپلیکیشن جدید کار می‌کند. در‌حال‌حاضر، اگر چندین اپلیکیشن جدید نصب کنید، بعد از تمام‌شدن یک جفت از آن‌ها، دانلود دو اپلیکیشن بعدی شروع می‌شود. اپ استور گوشی آیفون توانایی دانلود و نصب سه اپلیکیشن را هم‌زمان ارائه می‌دهد. ویژگی جدید گوگل پلی برای به‌روزرسانی‌ برنامه‌های از‌پیش‌نصب‌شده اعمال نمی‌شود. این ویژگی جدید با موبایل دارای اندروید ۱۴ و نسخه‌ی ۴۰٫۶٫۳۱ گوگل پلی آزمایش شده است و به‌مرور‌زمان برای گوشی‌های قدیمی با سیستم‌عامل قدیمی‌تر منتشر می‌شود.",
  },

  {
    id: 8,
    title:
      "پردازنده پرچم‌دار ۲۰۲۴ مدیاتک قوی‌تر از اسنپدراگون ۸ نسل ۴ خواهد بود؟ ",

    author: "علی عبدالملکی",
    category: "تکنولوژی",
    image: img7,
    date: new Date(2024, 7, 7),
    view: 777,
    favorite: 354,
    content:
      "تراشه‌ی پرچم‌دار بعدی مدیاتک، دیمنسیتی ۹۴۰۰، احتمالاً از رقبای اصلی خود سریع‌تر خواهد بود. حساب کاربری Digital Chat Station با انتشار پستی در ویبو ادعا کرد که دیمنسیتی ۹۴۰۰ ازنظر IPC یا دستورالعمل بر سیکل کلاک می‌تواند اسنپدراگون ۸ نسل ۴ کوالکام و A17 Pro اپل را شکست دهد. بهتربودن IPC، یعنی در فرکانس ثابت دیمنسیتی ۹۴۰۰ محاسبات بیشتری انجام می‌دهد؛ البته این محاسبات بیشتر ممکن است به قیمت افزایش توان مصرفی تمام شود. Digital Chat Station شایعات همکاری نزدیک مدیاتک و ARM برای توسعه‌ی دیمنسیتی ۹۴۰۰ را تأیید کرده است. گزارش‌ها نشان می‌دهند که این تراشه از جدیدترین معماری CPU آرم که با اسم رمز BlackHawk شناخته می‌شود، استفاده خواهد کرد. کوالکام مسیری کاملاً متفاوت با مدیاتک را برای توسعه‌ی تراشه‌ی پرچم‌دار بعدی خود در پیش گرفته است؛ زیرا هسته‌های اسنپدراگون ۸ نسل ۴ از معماری استارتاپ نوویا استفاده خواهند کرد. اطلاعات فاش‌شده نشان می‌دهند که هسته‌ی Cortex-X5 در دیمنسیتی ۹۴۰۰ از هسته‌های نوویا و هسته‌های تراشه‌ی A17 Pro اپل ازنظر IPC عملکرد بهتری ارائه می‌دهد. با‌این‌حال، عدد مشخصی برای تأیید این ادعاها دردسترس نیست. دستورالعمل بر سیکل کلاک (IPC) معیاری برای اندازه‌گیری کارایی پردازنده است. این معیار اساساً نشان می‌دهد که هر هسته‌ی پردازنده می‌تواند چند دستور را در یک چرخه‌ی کلاک واحد اجرا کند. اگر دیمنسیتی ۹۴۰۰ واقعاً ازنظر IPC از هسته‌های جدید نوویا کوالکام پیشی بگیرد، می‌تواند عملکرد بسیار بهتری از رقیب خود ارائه دهد. اطلاعات مربوط به عملکرد تراشه‌ی پرچم‌دار بعدی مدیاتک فعلاً فقط در حد شایعه هستند و برای تأیید مشخصات واقعی سیستم-روی-چیپ مذکور باید منتظر بنچمارک‌ها و مشخصات رسمی بمانیم.",
  },
  {
    id: 9,
    title: "سایدلود در راه آیپد؛ اروپا به تغییرات آیفون بسنده نمی‌کند",

    author: "علی v",
    category: "تکنولوژی",
    image: img9,
    date: new Date(2024, 8, 7),
    view: 767,
    favorite: 394,
    content:
      "با فشار اروپا و قانون بازارهای دیجیتال، سایدلود دردسترس کاربران آیپد نیز قرار می‌گیرد. اپل در ماه‌های اخیر با فشار قانون بازارهای دیجیتال اتحادیه‌ی اروپا (DMA) تغییرات گسترده‌ای در اکوسیستم آیفون اعمال کرده است. این شرکت برای مطابقت با DMA، در به‌روزرسانی‌ iOS 17.4 استفاده از فروشگاه‌های جایگزین اپ‌ استور و امکان پرداخت از وب و استفاده از موتورهای جدید مرورگرها را ممکن کرد. گزارش بلومبرگ نشان می‌دهد که قانون بازارهای دیجیتال که پیش‌تر فقط بر گوشی آیفون اعمال شده بود، اکنون گریبان‌گیر آیپد شده و اتحادیه‌ی اروپا iPadOS را وارد فهرست پلتفرم‌های دربان کرده است. عبارت پلتفرم‌های دربان به پلتفرم‌هایی اطلاق می‌شود که تسلط بسیار زیادی بر بازار دارند. در‌حال‌حاضر پشتیبانی از فروشگاه اپلیکیشن جایگزین اپ استور و سایدلود فقط در‌دسترس کاربران آیفون در اتحادیه‌ی اروپا قرار دارد؛ اما به‌زودی در‌دسترس کاربران آیپد نیز قرار خواهد گرفت. بعد از تصمیم اتحادیه‌ی اروپا، اپل تقریباً ۶ ماه فرصت دارد تا آیپد و سیستم‌عامل iPadOS را با قوانین جدید مطابقت دهد؛ بنابراین، در آینده‌ای نزدیک تمام تغییرات آیفون بر آیپد نیز اعمال خواهند شد. تغییرات اپل باتوجه‌به قوانین جدید به کاربران آیپد امکان خواهد داد تا اپلیکیشن‌ها را از فروشگاه‌های جایگزین مانند AltStore دانلود کنند. شرکت‌هایی مانند اسپاتیفای از اپل به‌دلیل ایجاد موانعی مانند کارمزد Core Technology Fee شکایت کرده‌اند. به‌موجب این کارمزد، توسعه‌دهندگان باید به‌ازای نصب اپلیکیشن‌ها به اپل پول بدهند. ",
  },
  {
    id: 10,
    title: "باگ عجیب واتساپ صدای کاربران اندروید را درآورد",

    author: "علی v",
    category: "تکنولوژی",
    image: img10,
    date: new Date(2024, 5, 23),
    view: 767,
    favorite: 4,
    content:
      "باگ جدید واتساپ، کابران اندروید را با مشکل تازه‌ای روبه‌رو کرده و انتقادهای زیادی به‌دنبال داشته است. باگی عجیب در جدیدترین نسخه‌ی واتساپ، امکان ارسال فایل‌های ویدیویی را در گوشی‌های اندرویدی از بین می‌برد. گزارش‌های متعدد کاربران در ردیت نشان می‌دهد که هنگام ارسال یک ویدیو در واتساپ پیامی با این عنوان نمایش داده می‌شود: «نمی‌توان این ویدیو را ارسال کرد. ویدیوی دیگری را انتخاب و دوباره امتحان کنید.» ارسال‌نشدن ویدیو برای همه‌ی کاربران اندروید صدق نمی‌کند. گزارش‌ها نشان می‌دهند که مشکل مورد بحث جدیدترین نسخه‌ی بتای واتساپ را نیز تحت تأثیر قرار داده است. بازگشت به نسخه‌ی ۲٫۲۴٫۸٫۸۵ می‌تواند مشکل را موقتاً حل کند. متا تاکنون واکنشی به این مشکل نشان نداده است.",
  },
];
